In [1]:
import pandas as pd

In [3]:
file = pd.read_csv("main.csv")

In [4]:
file.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [5]:
file.tail()

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

In [8]:
solution = file.groupby(['occupation'])['age'].agg(['min','max'])

In [9]:
solution.head()

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70

In [10]:
solution.tail()

            min  max
occupation
salesman     18   66
scientist    23   55
student       7   42
technician   21   55
writer       18   60

In [11]:
solution.to_csv('output_2.csv')